        
import requests

# ეს არის პარლამენტის API ის მისამართი საიდანაც ვიღებთ ინფორმაციას
url = "https://info.parliament.ge/law/1/bill"


# ეს ფუნქცია იღებს დოკუმენტებს პარლამენტის API დან
def get_bills():

    headers = {
        "User-Agent": "Mozilla/5.0" #აქ ვუთითებთ, რომ HTTP ის მოთხოვნა ბრაუზერის მსგავსად იგზავნება
    }

# აქ მითითებული მაქვს API ის მოთხოვნის პარამეტრები: რომელი ჩანაწერიდან ვიწყებთ და რამდენ ჩანაწერს ვღებულობთ
# start - ზე  20 იმიტო მაქ მითითებული რო პირველი 20 ჩანაწერში კანონპროექტები არ იყო, მხოლოდ დადგენილებები და წარდგინებები იყო
    params = {
        "start": 20,
        "limit": 20
    }
# ამით მოთხოვნას ვაგზავნით
    response = requests.get(url, headers=headers, params=params)

# პირველი ფილტრი, თუ მოთხოვნა წარმატებულია 
    if response.status_code == 200:

        data = response.json()

        filtered_bills = [] # ვქმნით ცარიელ ცვლადს ლისტის სახით რომ შემდგომ დავამატოთ გაფილტრული დოკუმენტები

# აქ ლუპის მეშვეობით ვაკეთებთ მეორე ფილტრებს რათა პარლამენტიუს საიტიდან მხოლოდ კანონპროექტები და ორგანული
#კანონის პროექტები წამოვიღოთ

        for bill in data["list"]:

            if bill["billType"]["id"] == 1 or bill["billType"]["id"] == 11:
                filtered_bills.append(bill) # - - - - - აქ ვამატებთ ლისტში
                
# აქ კი ლისტის სახით ვაბრუნებთ
        return filtered_bills 

    else:
        return []